<template>
  <div>
    <div class="container cont-tl mb-5">
      <div class="row justify-content-center">
        <div class="col-xl-10 col-12 text-center">
          <h2>Заработаем на простых действиях!!</h2>
          <p>
            Компании готовы платить, за то что Вы есть! помогите им это сделать,
            весь доход делим пополам
          </p>
          <p>
            Только только начинаю такой вид деятельности, ещё не все шаги точно
            рабочие, могут и не сработать а могут и сработать! давайте сделаем
          </p>
        </div>
      </div>

      <div v-for="i in list" :key="i.name" class="row justify-content-center">
        <div class="my-4 col-12 text-center">
          <h2>{{ i.name }}</h2>
        </div>

        <div class="col-12">
          <h4>
            получите
            <span class="fs-2 bg-warning px-5 py-2 rounded">{{ i.summa }}</span>
          </h4>
          <br />
          <br />
          <br />
          <h4>Условия</h4>
          <ol>
            <li v-for="p in i.kto" :key="p"><span v-html="p"></span></li>
          </ol>
          <br />
          <br />
          <br />
          <h4>Описание</h4>
          <ol>
            <li v-for="p in i.opis" :key="p"><span v-html="p"></span></li>
          </ol>

          <br />
          <br />
          <br />
          <h4>После получения печенек)</h4>

          {{ i.potom }}
        </div>
      </div>
    </div>
  </div>
</template>

<script setup>
const list = [
  {
    name: 'Альфа банк платит за регистрацию первой карты',
    summa: 'около 500р',
    kto: [
      'Живёте в России',
      'больше 20 лет',
      'раньше никогда не было карточки от Альфа Банка',
    ],
    opis: [
      'Заходите в телеграм бота <A href="https://t.me/UralwebBot" target="_blank" >@Uralweb</a> и пишите ему "дай ссылку на альфа банк" ',
      'Отправляет Вам ссылку',
      'Переходите по ссылке, регистрируетесь и заказываете карту бесплатная дебетовая (курьер привезёт бесплатно)',
      'Пишите в бота "альфабанк карта на руках, меня зовут **** карта номер ***** "',
      'Я пополню вам карту на 30р и нужно что нить купить в магазине незначительное "горсть конфет" например (чтобы банк увидел что вы пользуетесь картой) ...',
      'Потом банк платит мне вознаграждение за приглашение Вас, и мы его делим 50/50, отправлю денег на карту или на телефон куда скажете (напишите в бота куда прислать)',
    ],
    potom: 'Можете закрыть карту (в лк) и вопрос закрыт',
  },
]
</script>

<style lang="scss"></style>
